Autodesk.Revit.DB.Architecture.StairsComponentConnectionEndType
The end type identifying the connection type among stairs runs and landings.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsComponentConnectionEndType.ET_RunEnd
A connection to the end (upper end) of a stairs run.

Autodesk.Revit.DB.Architecture.StairsComponentConnectionEndType.ET_RunStart
A connection to the start (lower end) of a stairs run.

Autodesk.Revit.DB.Architecture.StairsComponentConnectionEndType.ET_Landing
A connection to the boundary of a stairs landing.